[
   {
        "name": "provision",
        "owner": "puppetlabs",
        "description": "Provisions and tears down containers / vms / machines through tasks."
    },
    {
        "name": "dependency_checker",
        "owner": "puppetlabs",
        "description": "The dependency-checker tool validates dependencies in metadata.json files in Puppet modules or YAML files containing arrays of Puppet modules against the latest published versions on the Puppet Forge."
    },
   {
        "name": "puppet_litmus",
        "owner": "puppetlabs",
        "description": "Litmus provides a simple command line tool for Puppet content creators, to enable both simple and complex test deployments against specifically configured target systems."
    },
    {
        "name": "litmusimage",
        "owner": "puppetlabs",
        "description": "This repository creates docker image files, for testing puppet modules with services with Puppet Litmus."
    },
    {
        "name": "pdk-docker",
        "owner": "puppetlabs",
        "description": "Official Puppet Development Kit (PDK) Docker Image."
    },
    {
        "name": "pdk-templates",
        "owner": "puppetlabs",
        "description": "The templates used by the PDK to create new modules and other objects."
    },
    {
        "name": "pdk-vanagon",
        "owner": "puppetlabs",
        "description": "This project contains all the code to create native packages of the PDK for all supported platforms."
    },
    {
        "name": "pdk",
        "owner": "puppetlabs",
        "description": "Command line tool for generating and testing modules."
    },
    {
        "name": "pdksync",
        "owner": "puppetlabs",
        "description": "PDKSync is an efficient way to run a command against the various Puppet module repositories that you manage, keeping them up-to-date with the changes made to PDK."
    },
    {
        "name": "PuppetDscBuilder",
        "owner": "puppetlabs",
        "description": "A PowerShell function to wrap DSC resources in puppet providers."
    },
    {
        "name": "puppet-lint",
        "owner": "puppetlabs",
        "description": "Check that your Puppet manifests conform to the style guide."
    },
   {
        "name": "puppet-modulebuilder",
        "owner": "puppetlabs",
        "description": "The canonical gem to build puppet modules."
    },
    {
        "name": "puppet-strings",
        "owner": "puppetlabs",
        "description": "Puppet Strings generates documentation for Puppet code and extensions written in Puppet and Ruby. Strings processes code and YARD-style code comments to create documentation in HTML, Markdown, or JSON formats."
    },
    {
        "name": "puppetlabs_spec_helper",
        "owner": "puppetlabs",
        "description": "A set of shared spec helpers specific to Puppetlabs projects."
    },
    {
        "name": "rspec-puppet",
        "owner": "puppetlabs",
        "description": "RSpec tests for your Puppet manifests."
    },
    {
        "name": "ruby-pwsh",
        "owner": "puppetlabs",
        "description": "This gem enables you to execute PowerShell from within ruby without having to instantiate and tear down a PowerShell process for each command called."
    },
    {
        "name": "puppet-vscode",
        "owner": "puppetlabs",
        "description": "Puppet Editing. Redefined"
    },
    {
        "name": "puppet-editor-services",
        "owner": "puppetlabs",
        "description": "Puppet language server for editors"
    }
]
